bpmn/MSOCommonBPMN/src/test/resources/__files/vnfAdapterMocks/vnfCreateSimResponse.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:v1="http://org.onap.so/vnfNotify">
	<soapenv:Header />
	<soapenv:Body>
			<ns2:createVnfNotification xmlns:ns2="http://org.onap.so/vnfNotify">
   <messageId>edab9ec7-6cf8-47cf-b58c-9ba4ef5d3f70</messageId>
   <completed>true</completed>
   <vnfId>slcp34248vbc/020a112b-a0c8-4143-87a3-698680ba2efe</vnfId>
   <outputs>
      <entry>
         <key>server_ip</key>
         <value>135.21.249.178</value>
      </entry>
   </outputs>
   <rollback>
      <cloudSiteId>MTSNJA4LCP1</cloudSiteId>
      <msoRequest>
         <requestId>1512_1120-BB11-1</requestId>
         <serviceInstanceId>BB11/VLXM/003717//SW_INTERNET</serviceInstanceId>
      </msoRequest>
      <tenantCreated>false</tenantCreated>
      <tenantId>e25ac2f1e73d46428de81a6130a6fdad</tenantId>
      <vnfCreated>true</vnfCreated>
      <vnfId>slcp34248vbc/020a112b-a0c8-4143-87a3-698680ba2efe</vnfId>
   </rollback>
</ns2:createVnfNotification>
	</soapenv:Body>
</soapenv:Envelope>
